In [1]:
# three data structures âˆ’
# Series - 1D labeled homogeneous array, size immutable, Homogeneous,  data values mutable
# DataFrame- General 2D labeled, size-mutable, data mutable tabular structure , heterogenous
# Panel- General 3D labeled, size-mutable , Data Mutable

In [1]:
# Syntax: pandas.Series( data, index, dtype, copy)
# data-data takes various forms like ndarray, list, constants
# index-Index values must be unique and hashable, same length as data. Default np.arrange(n) if no index is passed.
# dtype-dtype is for data type,If None, data type will be inferred
# copy- Copy data.

import pandas as pd
import numpy as np
s = pd.Series()
s

Series([], dtype: float64)

In [3]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [4]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [5]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
s

a    0.0
b    1.0
c    2.0
dtype: float64

In [6]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
s

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [7]:
s = pd.Series(5, index=[0, 1, 2, 3])
s

0    5
1    5
2    5
3    5
dtype: int64

In [8]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s[0]

1

In [10]:
s['a']

1

In [11]:
s[:3]

a    1
b    2
c    3
dtype: int64

In [12]:
s[['a','c','d']]

a    1
c    3
d    4
dtype: int64

In [13]:
# Syntax: pandas.DataFrame( data, index, columns, dtype, copy)
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [14]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [15]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [15]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [16]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [17]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [18]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print(df1,df2)

        a   b
first   1   2
second  5  10         a  b1
first   1 NaN
second  5 NaN

In [19]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
      'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [20]:
df ['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [21]:
print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']
df

Adding a new column by passing as Series:
Adding a new column using the existing columns in DataFrame:

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [22]:
# using del function
print ("Deleting the first column using DEL function:")
del df['one']
df
# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
df

Deleting the first column using DEL function:
Deleting another column using POP function:

   three  four
a   10.0  11.0
b   20.0  22.0
c   30.0  33.0
d    NaN   NaN

In [23]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [24]:
# Deleting with label
df.drop(0)

   a  b
1  3  4
1  7  8

In [25]:
 
# Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

# Create a DataFrame
df = pd.DataFrame(d)
print ("The transpose of the data series is:")
df.T

The transpose of the data series is:

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [26]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [27]:
# sum to add values at axis 0 which is by default
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [28]:
df['Age'].sum()

382

In [29]:
df.sum(1) # doing it ata axis 1

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [30]:
df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [31]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

In [36]:
# count()	Number of non-null observations
# sum()	Sum of values
# mean()	Mean of Values
# median()	Median of Values
# mode()	Mode of values
# std()	Standard Deviation of the Values
# min()	Minimum Value
# max()	Maximum Value
# abs()	Absolute Value
# prod()	Product of Values
# cumsum()	Cumulative Sum
# cumprod()	Cumulative Product

# sum(), cumsum() work with both numeric and character (or) string data elements without any error.
df.mode()

      Name   Age  Rating
0   Andres  23.0    2.56
1   Betina  25.0    2.98
2    David  30.0    3.20
3   Gasper   NaN    3.24
4     Jack   NaN    3.65
5    James   NaN    3.78
6      Lee   NaN    3.80
7    Ricky   NaN    3.98
8    Smith   NaN    4.10
9    Steve   NaN    4.23
10     Tom   NaN    4.60
11     Vin   NaN    4.80

In [38]:
# describe() function computes a summary of statistics pertaining to the DataFrame columns.

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [39]:
# 'include' is the argument which is used to pass necessary information regarding what columns need to be considered for summarizing. Takes the list of values; by default, 'number'.

# object âˆ’ Summarizes String columns
# number âˆ’ Summarizes Numeric columns
# all âˆ’ Summarizes all columns together (Should not pass it as a list value)

df. describe(include='all')

          Name        Age     Rating
count       12  12.000000  12.000000
unique      12        NaN        NaN
top     Betina        NaN        NaN
freq         1        NaN        NaN
mean       NaN  31.833333   3.743333
std        NaN   9.232682   0.661628
min        NaN  23.000000   2.560000
25%        NaN  25.000000   3.230000
50%        NaN  29.500000   3.790000
75%        NaN  35.500000   4.132500
max        NaN  51.000000   4.800000

In [41]:
N=20

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})

#reindex the DataFrame
df_reindexed = df.reindex(index=[0,2,5,1], columns=['A', 'C', 'B','x'])
df_reindexed

           A     C   B    x
0 2016-01-01  High NaN  0.0
2 2016-01-03  High NaN  2.0
5 2016-01-06   Low NaN  5.0
1 2016-01-02  High NaN  1.0

In [42]:
df

            A     x         y       C           D
0  2016-01-01   0.0  0.977635    High   91.385838
1  2016-01-02   1.0  0.128857    High  110.481156
2  2016-01-03   2.0  0.570309    High  102.974291
3  2016-01-04   3.0  0.077084  Medium   98.589005
4  2016-01-05   4.0  0.798431     Low   79.405559
5  2016-01-06   5.0  0.222491     Low  102.162299
6  2016-01-07   6.0  0.368362     Low   96.664520
7  2016-01-08   7.0  0.758085  Medium  101.107620
8  2016-01-09   8.0  0.312889     Low   91.116130
9  2016-01-10   9.0  0.505218  Medium   93.687491
10 2016-01-11  10.0  0.754259  Medium  106.929472
11 2016-01-12  11.0  0.786570  Medium  101.393496
12 2016-01-13  12.0  0.459690    High  102.281622
13 2016-01-14  13.0  0.440823  Medium   93.662015
14 2016-01-15  14.0  0.965636  Medium  101.222708
15 2016-01-16  15.0  0.185717  Medium  101.225941
16 2016-01-17  16.0  0.624672     Low  117.212117
17 2016-01-18  17.0  0.149927     Low   86.877645
18 2016-01-19  18.0  0.512857  Medium   73.530712
19 2016-01-20  19.0  0.485990  Medium  102.802697

In [43]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])

df1 = df1.reindex_like(df2) # reindexing like another dataframe

In [44]:
df1

       col1      col2      col3
0 -0.344862  0.418884 -1.673140
1  0.760441 -0.235627  0.561189
2  0.137034 -2.328784  0.837602
3 -0.829654 -0.533983 -0.352697
4 -2.301679  0.992690 -1.014321
5  0.528390 -2.392803  0.833917
6  0.916975 -0.341494 -0.779111

In [45]:
df2

       col1      col2      col3
0  0.680604 -0.168350  0.505938
1  0.346135  0.489520  0.487436
2 -0.886384  0.243953 -0.855728
3  0.095433  0.155940  0.317870
4 -1.094733 -0.493284  0.777815
5  1.099213  1.301756 -1.898410
6  0.821813  0.398282  1.167407